In [2]:
import os
import sys
module_path = os.path.abspath(os.path.join(os.pardir))
if module_path not in sys.path:
    sys.path.append(module_path)
    
import pandas as pd

In [3]:
def create_df(csv):
    relative_filename = os.path.abspath(os.path.join(os.pardir, 'data', csv))
    df1 = pd.read_csv(relative_filename)

    return df1

In [4]:
item_cats = create_df('item_categories.csv')

In [5]:
train_data = create_df('sales_train.csv')

In [6]:
items = create_df('items.csv')

In [7]:
shops = create_df('shops.csv')

In [8]:
train_data.shape

(2935849, 6)

In [9]:
train_data.columns

Index(['date', 'date_block_num', 'shop_id', 'item_id', 'item_price',
       'item_cnt_day'],
      dtype='object')

In [12]:
test_data = create_df('test.csv')

In [13]:
test_data

            ID  shop_id  item_id
0            0        5     5037
1            1        5     5320
2            2        5     5233
3            3        5     5232
4            4        5     5268
...        ...      ...      ...
214195  214195       45    18454
214196  214196       45    16188
214197  214197       45    15757
214198  214198       45    19648
214199  214199       45      969

[214200 rows x 3 columns]

In [23]:
train_data['shop_id'].value_counts()

31    235636
25    186104
54    143480
28    142234
57    117428
42    109253
27    105366
6      82663
58     71441
56     69573
46     66321
50     65173
19     63911
15     59511
35     58445
21     58133
7      58076
47     56695
26     53910
18     53227
24     53032
53     52921
16     52734
30     50860
29     49225
38     46013
22     45434
51     44433
52     43502
59     42108
41     41967
37     39638
44     39530
43     39282
4      38242
5      38179
14     36979
45     35891
55     34769
12     34694
2      25991
3      25532
17     22950
48     21612
10     21397
13     17824
49     15849
39     13440
0       9857
32      7947
23      6963
34      5752
1       5678
33      5027
40      4257
9       3751
8       3412
20      1792
11       499
36       306
Name: shop_id, dtype: int64

In [43]:
eda_test = train_data[train_data['shop_id'] == 31]

In [44]:
eda_test

,date,date_block_num,shop_id,item_id,item_price,item_cnt_day
60143,03.01.2013,0,31,4906,1794.0,2.0
60144,02.01.2013,0,31,4906,1789.0,1.0
60145,11.01.2013,0,31,4890,799.0,1.0
60146,26.01.2013,0,31,4901,1499.0,1.0
60147,25.01.2013,0,31,4901,1499.0,1.0
...,...,...,...,...,...,...
2928767,01.10.2015,33,31,1540,1999.0,1.0
2928768,07.10.2015,33,31,1540,1999.0,1.0
2928769,10.10.2015,33,31,1540,1999.0,1.0
2928770,23.10.2015,33,31,1484,1199.0,1.0
2928772,26.10.2015,33,31,11466,249.0,1.0

In [45]:
eda_test.columns

Index(['date', 'date_block_num', 'shop_id', 'item_id', 'item_price',
       'item_cnt_day'],
      dtype='object')

In [51]:
eda_test['date'].value_counts()

30.12.2014    669
30.12.2013    638
28.12.2013    621
29.12.2013    620
29.12.2014    602
             ...
28.10.2015    100
02.08.2015     95
21.09.2015     90
28.04.2015     89
14.06.2015     83
Name: date, Length: 1031, dtype: int64

In [49]:
eda_test.sort_values(axis=0, by='date')[eda_test['item_id'] == 9440]

/Users/kyledecember1/opt/anaconda3/envs/learn-env/lib/python3.6/site-packages/ipykernel_launcher.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  """Entry point for launching an IPython kernel.

              date  date_block_num  shop_id  item_id  item_price  item_cnt_day
193252  01.02.2013               1       31     9440       499.0           1.0
237884  10.03.2013               2       31     9440       499.0           1.0
62250   11.01.2013               0       31     9440       499.0           1.0